%include '.\func_store\func.sas';

/*財政系*/
%let depart = finan;
/* 必修： required subject */
%let req_list ="統計學" "個體經濟學" "總體經濟學" "貨幣銀行學" "所得稅理論與制度" 
				"租稅法" "微積分" "經濟學" "會計學" "商事法"
                "財政學（一）" "中級會計學" "消費稅理論與制度" "財產稅理論與制度";
/* 選修：elective subject */
%let elect_list = "民法概要" "經濟數學" "公債理論與管理" "國際金融理論與政策" "都市經濟與政策" 
						"計量經濟學" "財政學（二）"  "金融制度與實務" "成本會計" "行為財政學"
                       	"社會安全制度(一)" "投資學:理論與監理" "預算理論與制度" "財政學名著選讀" "國際租稅"
                        "賽局理論" "比較租稅制度" "公共選擇" "財務管理" "成本效益分析" 
						"財務報表分析" "地方財政" "關稅理論與制度" "財政議題與軟體應用" "醫療財政"
                        "財政大講堂" "國際金融專題" "比較租稅制度(一)" "社會安全制度與政策(一)" "比較租稅制度(二)"
                       "財政金融實務分析" "社會安全制度與政策(二)" "財政金融實習" "公共事務專題" "財政大講堂";

/* 生成課程面向檔 */
%course_ori(&depart, &req_list, &elect_list, 3);

/* 每位學生分數計算 */
%spawn_radar_score(&depart, &req_list, &elect_list);

/*列印 doc 檔案*/
%output_doc(&depart, &stu_list, &stu_num);
