/*不動系*/
%let depart = realest;
/* 必修： required subject */
%let req_list = "建築學概論" "統計學" "環境規劃" "土地法" "土地經濟學" 
				"地理資訊系統" "環境規劃" "不動產估價" "土地登記" "都市及區域計畫理論" 
				"土地政策" "不動產估價實務" "不動產與城鄉環境專題" "民法概要" "經濟學"
                "測量學" "都市計畫" "地籍測量" "都市土地使用及交通運輸計畫" "地籍測量";
/* 選修：elective subject */
%let elect_list = "微積分" "電腦輔助繪圖" "不動產管理" "電腦輔助繪圖" "製圖學" 
						"論文寫作方法" "自然災害與衛星資訊" "不動產行銷" "不動產經濟學" "公共設施計畫" 
						"資料庫管理系統" "不動產財務管理" "分區使用管制" "不動產行銷" "都市設計（一）"
                        "都市經濟學" "分區使用管制" "住宅問題" "規劃分析" "不動產與城鄉環境實務操作" 
						"不動產投資" "都市更新" "計畫與社會" "都市及區域政策" "不動產市場分析"
                       	"不動產經紀法規" "環境生態學" "計畫法規" "土地稅法規" "不動產投資" 
						"地圖學" "測量平差法（一）" "土地重劃與徵收" "生態台灣" "土地登記實務" 
						"不動產開發" "不動產金融" "衛星定位測量" "信託法" "地租與地稅理論"
                        "災害管理" "不動產稅務應用" "環境法" "測量平差法（二）" "城鄉社區安全與減災實務" 
						"不動產經營管理" "環境遙測" "數位影像處理" "居家風水概論" "社區發展與實務（一）"
                        "土地法實務研究（一）" "規劃實務（一）" "測量實務" "地理資訊系統實務" "規劃實務（二）" 
						"大地測量學" "航空攝影測量" "不動產財務分析" "建築企劃" "行政法"
						"都市發展" "不動產經濟分析" "大數據之概說與應用" "土地利用與環境法";

/* 生成課程面向檔 */
%course_ori(&depart, &req_list, &elect_list, 3);

/* 每位學生分數計算 */
%spawn_radar_score(&depart, &req_list, &elect_list);

/*列印 doc 檔案*/
%output_doc(&depart, &stu_list, &stu_num);
